(define (fixed-point f first-guess)
  (define tolerance 0.00001)
  (define (close-enough? v1 v2)
    (< (abs (- v1 v2)) tolerance))
  (define (try guess)
    (let ((next (f guess)))
      (display next)
      (newline)
      (if (close-enough? guess next)
          next
          (try (f next)))))
  (try first-guess))


(print (fixed-point (lambda (x) (/ (log 1000) (log x)))
                    1.1))

; Вывод программы
;72.47657378429035
;14.45350138636525
;7.269672273367045
;5.536500810236703
;4.95053682041456
;4.721778787145103
;4.626821434106115
;4.586349500915509
;4.568901484845316
;4.561341971741742
;4.5580596716775874
;4.556633177654167
;4.556012967736543
;4.5557432655522394
;4.555625974816275
;4.555574964557791
;4.555552779647764
;4.555543131130589
;4.555538934848503
;4.555538934848503
