;Для интервальной арифметики ни для сложения, ни для умножения не определена
;обратная операция (вычитание не обратно сложению, а деление не)
;обратно умножению. Для того, чтобы выразить сказанное формально, нужно
;вводить понятия высшей алгебры (поле, группа, единичный элемент, обратная)
;операция и т.д., однако и на интуитивном уровне разница между числами и
;интервалами видится серьезной.
;Важным моментом является и понятие эквивалентности интервалов.
;Пусть мы хотим разделить интервал А=[1, 2] на интервал B=[1, 2].
;Мы получим интервал [1/2, 2]. Теперь разделим А на А. Очевидно, мы получим
;тот же результат. Мы никак не можем учесть при делении то, что теперь на
;самом деле делимое [1, 2] и делитель [1, 2] – это не просто интервалы
;с одинаковыми границами, а на самом деле представляют один и тот же объект.
;Для того, чтобы пакет для работы с интервальной арифметикой подчинялся
;законам алгебры, необходимо вводить операции таким образом, чтобы для них
;выполнялись некоторые базовые свойства (это вновь затронет высшую алгебру).
;Это принципиально возможно и не представляет особой сложности.
